/*
 * Оператор switch
 */

/*
? Напиши скрипт вибору опції доставки товара.
? Опція зберігається в змінній option: 1 - самовивіз, 2 - кур'єр, 3 - пошта
?
? В змінну message записати повідомлення в залежності від опції.
? - 'Ви можете забрати товар завтра з 12:00 в нашому офісі'
? - 'Кур'єр доставить замовлення завтра з 9:00 до 18:00'
? - 'Посилку буде відправлено сьогодні'
? - 'Вам передзвонить менеджер'
 */

const option = null;
let message = '';

switch (option) {
  case 1: {
    message = 'Ви можете забрати товар завтра з 12:00 в нашому офісі';

    break;
  }

  case 2: {
    message = 'Кур`єр доставить замовлення завтра з 9:00 до 18:00';

    break;
  }

  case 3: {
    message = 'Посилку буде відправлено сьогодні';

    break;
  }

  default: {
    message = 'Вам передзвонить менеджер';
  }
}

console.log(message);
